# PanelScheduleSlotInconsistency Property (2024)

---
C#Visual BasicVisual C++
Revit 2024 API
---
BuiltInFailures..::..ScheduleViewFailures..::..PanelScheduleSlotInconsistency Property
BuiltInFailures..::..ScheduleViewFailures Class See Also
---
The template applied to this panel schedule is set to display fewer slots than what is needed to display the maximum number of 1-pole breakers set on the equipment.
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
# Syntax
C#
---
```text
public static FailureDefinitionId PanelScheduleSlotInconsistency { get; }
```

Visual Basic
---
```text
Public Shared ReadOnly Property PanelScheduleSlotInconsistency As FailureDefinitionId
	Get
```

Visual C++
---
```text
public:
static property FailureDefinitionId^ PanelScheduleSlotInconsistency {
	FailureDefinitionId^ get ();
}
```

# See Also
BuiltInFailures..::..ScheduleViewFailures Class
Autodesk.Revit.DB Namespace